#How to transform and customize tuple / list

In [ ]:
basic_tuple = ('first=1', 'second=smth', 'third=1.35')

In [7]:
for i in range(len(basic_tuple)):
    print("t." + basic_tuple[i][:basic_tuple[i].rfind('=')])

t.first
t.second
t.third

In [8]:
import pandas as pd

data = ['product=Tablet',
        'price=250']

In [9]:
df = pd.DataFrame(data)

In [10]:
df

                0
0  product=Tablet
1       price=250

In [11]:
products_list = df.values.tolist()

In [12]:
products_list

[['product=Tablet'], ['price=250']]

In [13]:
result=[v1 for sub_list in products_list for v1 in sub_list]

In [14]:
result

['product=Tablet', 'price=250']

In [15]:
for i in range(len(result)):
    print("t." + result[i][:result[i].rfind('=')])

t.product
t.price

#How to get tuple from a column

In [16]:
data1 = {'fruit': ['Apple','Pineapple','Banana','Peach', 'Mango'],
        'invent_number': [5755,9700,1200,3638,4199]
        }

In [19]:
df_fruit = pd.DataFrame(data1)

In [20]:
df_fruit

       fruit  invent_number
0      Apple           5755
1  Pineapple           9700
2     Banana           1200
3      Peach           3638
4      Mango           4199

In [21]:
invent_tuple = tuple(list(df_fruit['invent_number']))

In [22]:
invent_tuple

(5755, 9700, 1200, 3638, 4199)